pets = {}
a = input('введите имя питомца: ')
vid = input('введите вид питомца: ')
col = input('введите цвет')
voz = int(input('введите возраст: '))
nam = input('введите имя владельца: ')
w = []
if voz == 1:
    w = 'год.'
elif 2 <= voz < 5:
    w = 'года.'
elif 5 <= voz < 20:
    w = 'лет'
elif voz % 10 == 1:
    w = 'год'
elif 1 < voz % 10 < 5:
    w = 'года'
else:
    w = 'лет'
q = [['цвет ', col], ['вид питомца ', vid], ['по кличке', '"' + str(a) + '"'],
     ['возраст питомца ', str(voz) + ' ' + str(w)], ['Имя владельца ', nam]]
pets[a] = dict(q)
#print(pets)

print(f'это {col} {vid}, по кличке " {a} ". Возраст питомца: {voz}{w}. Имя владельца {nam}.')
